---
title: ViewNavigationToolSettings
classe: Autodesk.Revit.DB.ViewNavigationToolSettings
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# ViewNavigationToolSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `HomeCamera GetHomeCamera()` | `viewNavigationToolSettings.GetHomeCamera()` | HomeCamera |
| `ViewNavigationToolSettings GetViewNavigationToolSettings(Document)` | `ViewNavigationToolSettings.GetViewNavigationToolSettings(pADoc)` | ViewNavigationToolSettings |
| `Boolean IsHomeCameraSet()` | `viewNavigationToolSettings.IsHomeCameraSet()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```